In [2]:
import pandas as pd

In [3]:
seri=pd.Series([121,200,150,99],index=["reg","loj","cart","rf"])

In [4]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [5]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [6]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [7]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [ ]:
#eleman sorgulama

In [8]:
"reg" in seri

True

In [9]:
seri["reg"]

121

# PANDAS FRAME

In [11]:
import pandas as pd

In [12]:
l=[1,2,12,123,12]

In [13]:
l

[1, 2, 12, 123, 12]

In [14]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             12
3            123
4             12

In [15]:
import numpy as np

In [16]:
m=np.arange(1,10).reshape((3,3))

In [17]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [18]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [19]:
df =pd.DataFrame(m,columns=["var","var1","var2"])

In [20]:
df.head()

   var  var1  var2
0    1     2     3
1    4     5     6
2    7     8     9

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
#eleman işlemleri

In [23]:
import pandas as pd
import numpy as np

In [24]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [25]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [26]:
sozluk

{'var1': array([1, 7, 7, 1, 2]),
 'var2': array([2, 6, 9, 1, 7]),
 'var3': array([2, 6, 4, 6, 0])}

In [28]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     2     2
1     7     6     6
2     7     9     4
3     1     1     6
4     2     7     0

In [29]:
df

   var1  var2  var3
0     1     2     2
1     7     6     6
2     7     9     4
3     1     1     6
4     2     7     0

In [30]:
df.index=["a","b","c","d","d"]
df

   var1  var2  var3
a     1     2     2
b     7     6     6
c     7     9     4
d     1     1     6
d     2     7     0

In [31]:
df

   var1  var2  var3
a     1     2     2

In [32]:
df["c":"d"]

   var1  var2  var3
c     7     9     4
d     1     1     6
d     2     7     0

In [33]:
#silme

In [34]:
df.drop("a",axis=0)

   var1  var2  var3
b     7     6     6
c     7     9     4
d     1     1     6
d     2     7     0

In [35]:
#kalicidegisiklik

In [36]:
df.drop("a",axis=0,inplace=True)

In [37]:
df

   var1  var2  var3
b     7     6     6
c     7     9     4
d     1     1     6
d     2     7     0

In [38]:
#df.loc[0:3,"var3"]  normal iş ,iloc inğı sıralardex mantı

In [39]:
#koşullu işlemler  örn =[(df.var1>15),["var1","var2"]]

In [40]:
#pd.concat birleştirme

In [41]:
# merge ortak değişkenler birleştirir

In [42]:
#countu first last mean median std var sum fonk toplulaştırtırma fonksiyon

In [43]:
import seaborn as sns
import numpy as np
import pandas as pd

In [44]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [45]:
df.shape

(1035, 6)

In [46]:
df["mass"].mean()

2.6381605847953216

In [47]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [48]:
df.drqna().describe().T

AttributeError: 'DataFrame' object has no attribute 'drqna'

In [49]:
df.dropna().describe().T
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [50]:
datframe=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],'veri':[10,11,52,23,43,55]},columns=['gruplar','veri'])
datframe

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [53]:
datframe.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [54]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [56]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [57]:
df.groupby("method")["orbital_period"].describe()
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [58]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [59]:
import pandas as pd

In [60]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],'degisken1':[10,11,52,23,43,55],'degisken2':[10,11,52,23,43,55]},columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10         10
1       B         11         11
2       C         52         52
3       A         23         23
4       B         43         43
5       C         55         55

In [61]:
df.groupby("gruplar").mean()
df

  gruplar  degisken1  degisken2
0       A         10         10
1       B         11         11
2       C         52         52
3       A         23         23
4       B         43         43
5       C         55         55

In [62]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.5       16.5
B             27.0       27.0
C             53.5       53.5

In [63]:
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median max
gruplar
A              10   16.5  23        10   16.5  23
B              11   27.0  43        11   27.0  43
C              52   53.5  55        52   53.5  55

In [64]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10         23
B               11         43
C               52         55

In [65]:
#filter hazırladığımız fonksiyonu verisetine uygulamaya ayrıyor

In [66]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [67]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10         10
1       B         11         11
3       A         23         23
4       B         43         43

In [69]:
df_a =df.iloc[:,1:3]
df_a.transform(lambda x:(x-x.mean()) /x.std())

   degisken1  degisken2
0  -1.101533  -1.101533
1  -1.052210  -1.052210
2   0.970006   0.970006
3  -0.460342  -0.460342
4   0.526105   0.526105
5   1.117974   1.117974

In [70]:
#apply herhangi bir işlemi bütün datasetine uygular

In [71]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       194
degisken2       194
dtype: object

In [74]:
df_a.apply(np.mean)

degisken1    32.333333
degisken2    32.333333
dtype: float64

In [75]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.5       16.5
B             27.0       27.0
C             53.5       53.5